tap "caskformula/caskformula"
tap "microsoft/git"
tap "ngrok/ngrok"
tap "petebankhead/qupath"
brew "openjdk"
brew "bat"
brew "cmake"
brew "direnv"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "htop"
brew "icu4c@76"
brew "libxml2"
brew "openslide"
brew "pandoc"
brew "pkgconf"
brew "protobuf"
brew "rclone"
brew "rust"
brew "tmux"
brew "tree"
brew "yadm"
brew "petebankhead/qupath/openslide-java"
cask "basictex"
cask "inkscape"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "ngrok"
cask "signal"
cask "skim"
cask "wkhtmltopdf"
vscode "anthropic.claude-code"
vscode "dracula-theme.theme-dracula"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
